TestCases/BubbleShrink_02/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 95;

boundaryField
{
    "(Walls|Base)"

    {
        type            zeroGradient;
        value           $internalField;
    }

    Top
    {
        type            zeroGradient;
        value           uniform 100;
    }

    FrontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
